package App::Censure;

use Mojo::Base -strict;

# 0 => 'ok',     # OK
# 1 => 'filthy', # мат
# 2 => 'porno',  # порно
# 3 => 'low',    # политика
# 4 => 'drug',   # наркотики

my $vowel     = '[аеиоуыэюяёaeioyu]';
my $consonant = '[йцкнгшщзхфвпрлджчсмтбqwrtpsdfghjklzxcvbnm]';

my @pretext = (
	'[уyоo]      (?=[еёeхx])',
	'[вvbсc]     (?=[хпбмгжxpmgj])',
	'[вvbсc][ъь] (?=[еёe])',
	'ё           (?=[бb])',
	
	'[вvb][ыi]',
	'[зz3][аa]',
	'[нnh][аaеeиi]',
	'[вvb][сc]            (?=[хпбмгжxpmgj])',
	'[оo][тtбb]           (?=[хпбмгжxpmgj])',
	'[оo][тtбb][ъь]       (?=[еёe])',
	'[иiвvb][зz3]         (?=[хпбмгжxpmgj])',
	'[иiвvb][зz3][ъь]     (?=[еёe])',
	'[иi][сc]             (?=[хпбмгжxpmgj])',
	'[прдdg][оo] (?> [бb] (?=[хпбмгжxpmgj]) | [бb]  [ъь] (?=[еёe]) | [зz3] [аa])?',
	
	'[пp][рr][оoиi]',
	'[зz3][лl][оo]',
	'[нnh][аa][дdg]       (?=[хпбмгжxpmgj])',
	'[нnh][аa][дdg][ъь]   (?=[еёe])',
	'[пp][оo][дdg]        (?=[хпбмгжxpmgj])',
	'[пp][оo][дdg][ъь]    (?=[еёe])',
	'[рr][аa][зz3сc]      (?=[хпбмгжxpmgj])',
	'[рr][аa][зz3сc][ъь]  (?=[еёe])',
	'[вvb][оo][зz3сc]     (?=[хпбмгжxpmgj])',
	'[вvb][оo][зz3сc][ъь] (?=[еёe])',
	
	'[нnh][еe][дdg][оo]',
	'[пp][еe][рr][еe]',
	'[oРѕ][дdg][нnh][оo]',
	'[кk][oРѕ][нnh][оo]',
	'[мm][уy][дdg][оoаa]',
	'[oРѕ][уy][тt][оo]',
	'[дdg][уy][рpr][оoаa]',
	'[хx][уy][дdg][оoаa]',
	
	'[мm][нnh][оo][гg][оo]',
	'[мm][оo][рpr][дdg][оoаa]',
	'[мm][оo][зz3][гg][оoаa]',
	'[дdg][оo][лl][бb6][оoаa]',
);

my $pretext_str = join '|', @pretext;

my $censure = {
	'1' => [
		'.*(?<!су)[hхx][уyu][йiеeёяюju] (?<! hue(?= ) | hue(?=so ) | hyu(?= ) | хуе(?=дин) )',
		'.*[пp][eеёиi][зz3сc][дd]',
		'(?:[жрpn]|zh)[оo0][pп][kк]?[aаyуыiеeoои]',
		'(?<=[ \d]) (?>' . $pretext_str . ') (?<=[^\d][^\d]|[^\d][^\d] ) [eеё][бb6] (?:\s|[аa][^\d])',
		'(?>' . $pretext_str . ')? [бb6][лl](?:я|ya)(?:\s|$|[тt])',
		'[пp][иieе][дdg][eеaаoо][rpр]',
		'[мm][уy][дdg][аa]',
		'[мm][аa][нnh][дdg][aаyуыiеeoо](?<! манда(?=[лн])|манде(?=ль ))',
		'[гg][оoaа0][вvb][нnh][оoаaяеeyу]',
		'[ч4][eеiи][pрr][nhпн][о0oаa][жgmм][o0оaа][nп3зz]',
		'fu[cс]k',
		'л[оo][хx](?:' . $vowel . ')?(?:\s|$)',
		'[scс][yуu][kк][aаiи](?<! сука(?=ч[её]в' . $vowel . ' ))',
		'[scс][yуu][4ч][кk]',
		'[зz3][аa][лl][уy][пp][аa]'
	],
	
	'2' => [
		'(?>' . $pretext_str . ')? [eеё] (?<!не[её] ) [бb6](?: [уyиi] | [ыиiоoaаеeёуy][htнтlл] | [лl][оoаaыиiя] | [нn][уy] | [кk][аa] )',
		'[cсs][eе](?:[хx]|[kк][сc])(?:$|\s|' . $vowel . ')',
		'[бb6][лl](?:я|ya)[дdg]',
		'[пnpр][оo0][pрr][нnh]',
		'[пnpр][оo0аa][pрr][нnh][уyu][хx]',
		'[oо0][тt][сcs][oо0aа]',
		'[dд][еe][фfb][0aаkксcуyu]',
		'[dд][еe][vв][оo0aаkксcуyu](?<! дев[у|о](?=[ш|ч]е?к))',
		'[иi][нnh][тt][иi][мm](?<! intim(?=e))',
		'[э3зеe][cсs][kкc][0oо][pрr][tт]',
		'[3зz][оo0]{2}[фf]',
		'[pnп][o0о][prр][kк][aа]',
		'.*[дd][prр][оo0][ч4]',
		'(?>' . $pretext_str . ')[дd][prр][оo0][tт]',
		'[cсs][оo0][cсs][кk]',
		'[фf][аa][лl]{1,2}[o0о] (?<! fallo(?=ut) )',
		'[aа][nhн][yuу][sсc]',
		'[прp][еe][nhн]{1,2}[иi][сcs]',
		'[иi][нnh][дd][иiеe][вvb][иiеe][дd][уyu][аa][лl](?:[kк]|[оo0])',
		'[o0оaа][bб][hnн][aа][ж][ёоo0еe][нnh]',
		'[xх]{3,}',
		'[0oоaа][bб][оo0][prр][тt]',
		'[прpn][pрr][аaoо0][cс][тt][еeиi][уuтt]',
		'[gг][аaеe](?:[йияю]|ем|ев|ям|eм|em|y|у) (?<! га[ийя](?= ) | гей(?=' . $consonant .' ))',
		'[tт][рpr][аa][хx]([^е]|$)',
		'[bв][aа][гr][иi][нnпh][aаеeуyuы]?(?:[мm]и|[мm]|ищ[eе])?(?:\s|$)',
		'[aа][hnн][аa][лl][ьb]',
		'[aа][hnн][аa][лl](?:\s|$)',
		'[ч4]л[еe][hнпn]',
		'[оo0aа][нnh][оo0aа][нnh][iи] (?<! анони(?=мус) )',
		'ш[aаoо0]л[аa][вb]',
		'[3зэеe][рpr][оo][тt]',
		'[п][иi][cсs]ь{0,1}[кk]',
		'[iи][3zз][hnн][aа0оo][сcs][иi][лl]',
		'[тt][еe]л[кk]',
		'[pрr][аa][3zз][вvb][pрr][аa][tт]',
		'[пpn][уyu][tт][aа][нhn]',
		'[цcс][еeэ33][lл][kк]',
		'[оo0][рpr][гgr][иеie]',
		'[эеe3з][рpr][эеe3з][kк](?!(?:тиль))',
		'[scс][пpn][еe][рpr][mм](?!(?:ограмм[аы]|ogram))',
		'[аaоo0][рpr][аa][лl](?!esce)(?<! aral )',
		'[нnh][иi][gг][eе][pрr]',
		'[мm][иi][нnh]ь{0,1}[eе][тt]',
		'[мm][аa][сcs][тt][pрr]{0,1}[uyу]',
		'[лl][eеиi][3zзсcs][бb][oо0иieе]',
		'[дdg][aаоo0][сcs][уyu][rгg]',
		'[aаoо0][рpr][гg][aа][3zзcсs][мm]',
		'[кk][уyu][нhn]{1,2}[иi][лl]',
		'[кk][лl][иi][tтm][aоo0а][pрr]',
		'шлю[xхш]',
		'[сc][oо0][сc](?:[уиy]|ем|ущий|ущая|ущие|em|ать|aть|ет|eт)(?<! сосу(?=д ) | сосу(?=л(?:ь|е)к))',
		'[сc][oо0][сc][kк][иi]',
		'[pрп][оo0](?:[pрп][kк]|[п][kк]?)(?:' . $vowel . ')?(?:\s|$)',
		'поп[к]?(?:ой|ами|ам|ах) ',
		'[гr][eе][hnн][еeиi][тt][aа][лl][iиeе][яиiйю]',
		'[иi][3zз][вbvw][pрr][аa][щ]',
		'[вbvw][иi][bб][rpр][аa][тt][оo0][рp]',
		'[гg][оo0][лl](?:[ый|ая|iy|aya|j|aja])',
	],
	
	'3' => [
		'[pрп][yuу][tтm][иi][nн](?:' . $vowel . ')?(?:\s|$)',
		'[mм][eе][dgд][vwbв][eе][dgд][eе][vwbв](?:' . $vowel . ')?(?:\s|$)',
	],
	
	'4' => [
		'[мm][aа][рp][иiеe][хx][yу][aа][нhn]{1,2}',
		'[kк][оo0aа][нhn]{1,2}[оo0aа][прp][лl]',
		'[нnh][аa][рpr][kк][оo0aа][тt]',
		'[kк][аa0oо][kк][оo0aа][иi][nн]',
		'[гg][eе][рpr][оo0aа][иi][nн]',
		'[kк][оo0aа][нhn]{1,2}[aа][bб]{1,2}[еeиi][сc]',
		'(?:курительн|легальн).+\s*(?:смес|микс|порош|спайс)', 
		'(?:курительн[^\s]*\s+(?:смес|микс)|легальн[^\s]*\s+(?:спайс|порош)|ароматич[^\s]*\s+смес|(?:смес|микс)[^\s]*\s+курительн|(?:спайс|порош)[^\s]*\s+легальн|смес[^\s]*\s+ароматич)',
	]
};

my $censure_compiled = {map {
		my $reg_str = join '|', @{ $censure->{$_} };
		($_ => qr/(?:\s|\b)(?:$reg_str)/six);
	} keys %$censure};

my @censure_keys = sort keys %$censure_compiled;

# Проверям фразу или [фраза1, фраза2].
# Выдаём тип цензуры если для первой подходящей фразы.
sub check {
	my $phrase = shift;
	$phrase    = [ $phrase ] unless ( ref $phrase eq 'ARRAY' );
	return 0 unless @$phrase;
	for my $type ( @censure_keys ) {
		my $re = $censure_compiled->{$type};
		for (@$phrase) {
			return $type if $_ =~ $re;
		}
	}
	
	return 0;
}

# Проверям массив фраз [ { phrase => 'xxx' }, ... ]
# Ставим в фразах { censure => $type }
sub check_pack {
	my $pack = shift;
	return $pack unless ( ref $pack eq 'ARRAY' );
	return 0 unless @$pack;
	
	for my $type ( @censure_keys ) {
		my $re = $censure_compiled->{$type};
		foreach (@$pack) {
			$_->{'censure'} = $type if $_->{'phrase'} =~ $re;
		}
	}
	
	return $pack;
}

1;
